[
  {
    "idTema": 1,
    "nombre": "Angular",
    "duracion": 80,
    "descripcion": "Framework para aplicaciones web desarrollado en TypeScript, de código abierto, mantenido por Google, que se utiliza para crear y mantener aplicaciones web de una sola página. Se basa en el Modelo Vista Controlador (MVC).",
    "imagen": "../assets/img/angular.png",
    "informacion": "https://es.wikipedia.org/wiki/Angular_(framework)"
  },
  {
    "idTema": 2,
    "nombre": "NodeJs",
    "duracion": 100,
    "descripcion": "Entorno en tiempo de ejecución multiplataforma, de código abierto, para la capa del servidor basado en el lenguaje de programación JavaScript, asíncrono, con E/S de datos en una arquitectura orientada a eventos y basado en el motor V8 de Google.",
    "imagen": "../assets/img/nodejs.png",
    "informacion": "https://es.wikipedia.org/wiki/Node.js"
  },
  {
    "idTema": 3,
    "nombre": "Docker",
    "duracion": 20,
    "descripcion": "Proyecto de código abierto que automatiza el despliegue de aplicaciones dentro de contenedores de software, proporcionando una capa adicional de abstracción y automatización de virtualización de aplicaciones en múltiples sistemas operativos.",
    "imagen": "../assets/img/docker.png",
    "informacion": "https://es.wikipedia.org/wiki/Docker_(software)"
  },
  {
    "idTema": 4,
    "nombre": "MySQL",
    "duracion": 80,
    "descripcion": "Sistema de gestión de bases de datos relacional desarrollado por Oracle Corporation y está considerada como la base de datos de código abierto más popular del mundo.",
    "imagen": "../assets/img/mysql.png",
    "informacion": "https://es.wikipedia.org/wiki/MySQL"
  },
  {
    "idTema": 5,
    "nombre": ".Net",
    "duracion": 100,
    "descripcion": ".NET (anteriormente .NET Core) es un framework informático administrado, gratuito y de código abierto para los sistemas operativos Windows, Linux y macOS. Es un sucesor multiplataforma de .NET Framework.",
    "imagen": "../assets/img/net.png",
    "informacion": "https://es.wikipedia.org/wiki/Microsoft_.NET"
  },
  {
    "idTema": 6,
    "nombre": "Microservicios",
    "duracion": 30,
    "descripcion": "Método de desarrollo de software que consiste en construir una aplicación como un conjunto de pequeños servicios, con operaciones bien definidas e independientes entre sí.",
    "imagen": "../assets/img/micro.png",
    "informacion": "https://es.wikipedia.org/wiki/Arquitectura_de_microservicios"
  }
]
